blog-api/real-blog/app/controllers/articles_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
---
  def show
    render json: @articles = Article.find(params[:id])

INSERT INTO "articles" ("title", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "fasdf"], ["content", "adfsdaf"], ["created_at", "2018-09-07 18:55:58.161375"], ["updated_at", "2018-09-07 18:55:58.161375"]]
SELECT "articles".* FROM "articles"
---
  def create
    @article = Article.create!(article_params)
    render json: Article.all

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "articles" SET "content" = $1, "updated_at" = $2 WHERE "articles"."id" = $3  [["content", "It's the best place to live. I can't live any place else."], ["updated_at", "2018-09-13 13:35:33.916524"], ["id", 1]]
---
  def update
    article = Article.find(params[:id])
    article.update(article_params)